In [1]:
import numpy as np
import pandas as pd

In [2]:
[1,2,np.nan]

[1, 2, nan]

In [3]:
df1 = pd.DataFrame({'C1':[11,21,np.nan],
                   'C2':[15,np.nan,np.nan],
                   'C3':[10,20,30]})

In [4]:
df1

     C1    C2  C3
0  11.0  15.0  10
1  21.0   NaN  20
2   NaN   NaN  30

In [5]:
df1.isna() ## identify the missing value

      C1     C2     C3
0  False  False  False
1  False   True  False
2   True   True  False

In [6]:
df1.isna().sum()

C1    1
C2    2
C3    0
dtype: int64

In [7]:
df1

     C1    C2  C3
0  11.0  15.0  10
1  21.0   NaN  20
2   NaN   NaN  30

In [8]:
df1.dropna()     ## If we have enough data for further analysis then we can drop that row which is having null value

     C1    C2  C3
0  11.0  15.0  10

In [9]:
df1

     C1    C2  C3
0  11.0  15.0  10
1  21.0   NaN  20
2   NaN   NaN  30

In [10]:
df1.fillna(value=100)   ## we can fiil null value by using .fillna

      C1     C2  C3
0   11.0   15.0  10
1   21.0  100.0  20
2  100.0  100.0  30

In [11]:
df1

     C1    C2  C3
0  11.0  15.0  10
1  21.0   NaN  20
2   NaN   NaN  30

In [12]:
df1['C1'].fillna(df1['C1'].mean())

0    11.0
1    21.0
2    16.0
Name: C1, dtype: float64

In [13]:
df1['C1'].fillna(df1['C1'].median())

0    11.0
1    21.0
2    16.0
Name: C1, dtype: float64

In [14]:
df1.fillna(df1.mean())

     C1    C2  C3
0  11.0  15.0  10
1  21.0  15.0  20
2  16.0  15.0  30